#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/dsl-2022/gh-multi-channel-message/runs/run-1LbrbDHTSph4PvSe[0m
[0m
Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
[0m[1mdata.local_file.schema: Reading...[0m[0m
[0m[1mdata.local_file.schema: Read complete after 0s [id=59c7eabeec950c3ebd0bfc672827af3ce8d22707][0m
[0m[1mdata.aws_iam_policy_document.lambda_assume_role_document: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.lambda_document: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.datasource_assume_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.datasource_assume_role: Read complete after 0s [id=2027410878][0m
[0m[1mdata.aws_iam_policy_document.lambda_document: Read complete after 0s [id=2516577437][0m
[0m[1mdata.aws_iam_policy_document.lambda_assume_role_document: Read complete after 0s [id=3693445097][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_appsync_datasource.add_channel[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_appsync_datasource" "add_channel" {
      [32m+[0m [0m[1m[0mapi_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "tf_appsync_example"
      [32m+[0m [0m[1m[0mservice_role_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m             = "AMAZON_DYNAMODB"

      [32m+[0m [0mdynamodb_config {
          [32m+[0m [0m[1m[0mregion[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mtable_name[0m[0m = "message-channel"
        }
    }

[1m  # aws_appsync_datasource.query_channel[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_appsync_datasource" "query_channel" {
      [32m+[0m [0m[1m[0mapi_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "query_channel"
      [32m+[0m [0m[1m[0mservice_role_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m             = "AMAZON_DYNAMODB"

      [32m+[0m [0mdynamodb_config {
          [32m+[0m [0m[1m[0mregion[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mtable_name[0m[0m = "message-channel"
        }
    }

[1m  # aws_appsync_graphql_api.message_channel[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_appsync_graphql_api" "message_channel" {
      [32m+[0m [0m[1m[0marn[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mauthentication_type[0m[0m = "API_KEY"
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = "message-channel"
      [32m+[0m [0m[1m[0mschema[0m[0m              = <<-EOT
            schema {
                query: Query
                mutation: Mutation
            }
            
            type Query {
                getAllChannels(count: Int, nextToken: String): PaginatedChannels
                getChannel(id: Int): Channel
            }
            
            type PaginatedChannels {
                channels: [Channel]
                nextToken: String
            }
            
            type Mutation {
                createChannel(id: Int!, name: String!): Channel
            }
            
            type Channel {
                id: Int
                name: String
            }
        EOT
      [32m+[0m [0m[1m[0mtags_all[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0muris[0m[0m                = (known after apply)
    }

[1m  # aws_appsync_resolver.add_channel_resolver[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_appsync_resolver" "add_channel_resolver" {
      [32m+[0m [0m[1m[0mapi_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdata_source[0m[0m       = "tf_appsync_example"
      [32m+[0m [0m[1m[0mfield[0m[0m             = "createChannel"
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m              = "UNIT"
      [32m+[0m [0m[1m[0mrequest_template[0m[0m  = <<-EOT
            {
                "version": "2018-05-29",
                "operation": "PutItem",
                "key": {
                    "id":$util.dynamodb.toDynamoDBJson($ctx.args.id),
                    "type": $util.dynamodb.toDynamoDBJson("message")
                },
                "attributeValues": {        
                    "name": $util.dynamodb.toDynamoDBJson($ctx.args.name)
                    }
            }
        EOT
      [32m+[0m [0m[1m[0mresponse_template[0m[0m = <<-EOT
                $util.toJson($context.result)
        EOT
      [32m+[0m [0m[1m[0mtype[0m[0m              = "Mutation"

      [32m+[0m [0mcaching_config {
          [32m+[0m [0m[1m[0mcaching_keys[0m[0m = [
              [32m+[0m [0m"$context.arguments.id",
              [32m+[0m [0m"$context.identity.sub",
            ]
          [32m+[0m [0m[1m[0mttl[0m[0m          = 60
        }
    }

[1m  # aws_appsync_resolver.get_all_channel_resolver[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_appsync_resolver" "get_all_channel_resolver" {
      [32m+[0m [0m[1m[0mapi_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdata_source[0m[0m       = "query_channel"
      [32m+[0m [0m[1m[0mfield[0m[0m             = "getAllChannels"
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m              = "UNIT"
      [32m+[0m [0m[1m[0mrequest_template[0m[0m  = <<-EOT
                    {
                    "version" : "2017-02-28",
                    "operation" : "Query",
                     "query":{
                     	"expression":"#type = :type",
                        "expressionNames":{
                        	"#type":"type"
                        },
                        "expressionValues":{
                        	":type": $util.dynamodb.toDynamoDBJson("message")
                        }
                     },
                     "index":"sort-by-nummber-id",
                     "scanIndexForward":true        
                    #if( $context.arguments.count )
                        ,"limit": $util.toJson($context.arguments.count)
                    #end
                    #if( $context.arguments.nextToken )
                        ,"nextToken": $util.toJson($context.arguments.nextToken)
                    #end
                }
        EOT
      [32m+[0m [0m[1m[0mresponse_template[0m[0m = <<-EOT
                  {
                "channels": $util.toJson($context.result.items)
                #if( $context.result.nextToken )
                    ,"nextToken": $util.toJson($context.result.nextToken)
                #end
            }
        EOT
      [32m+[0m [0m[1m[0mtype[0m[0m              = "Query"

      [32m+[0m [0mcaching_config {
          [32m+[0m [0m[1m[0mcaching_keys[0m[0m = [
              [32m+[0m [0m"$context.arguments.id",
              [32m+[0m [0m"$context.identity.sub",
            ]
          [32m+[0m [0m[1m[0mttl[0m[0m          = 60
        }
    }

[1m  # aws_appsync_resolver.get_channel_resolver[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_appsync_resolver" "get_channel_resolver" {
      [32m+[0m [0m[1m[0mapi_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdata_source[0m[0m       = "query_channel"
      [32m+[0m [0m[1m[0mfield[0m[0m             = "getChannel"
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m              = "UNIT"
      [32m+[0m [0m[1m[0mrequest_template[0m[0m  = <<-EOT
                {
                    "version" : "2017-02-28",
                    "operation" : "GetItem",
                    "key": {
                     "id":$util.dynamodb.toDynamoDBJson($ctx.args.id)
                    }
                }
        EOT
      [32m+[0m [0m[1m[0mresponse_template[0m[0m = <<-EOT
                $util.toJson($context.result)
        EOT
      [32m+[0m [0m[1m[0mtype[0m[0m              = "Query"

      [32m+[0m [0mcaching_config {
          [32m+[0m [0m[1m[0mcaching_keys[0m[0m = [
              [32m+[0m [0m"$context.arguments.id",
              [32m+[0m [0m"$context.identity.sub",
            ]
          [32m+[0m [0m[1m[0mttl[0m[0m          = 60
        }
    }

[1m  # aws_dynamodb_table.message_channel[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_dynamodb_table" "message_channel" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mbilling_mode[0m[0m     = "PAY_PER_REQUEST"
      [32m+[0m [0m[1m[0mhash_key[0m[0m         = "type"
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "message-channel"
      [32m+[0m [0m[1m[0mrange_key[0m[0m        = "id"
      [32m+[0m [0m[1m[0mread_capacity[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mstream_arn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mstream_enabled[0m[0m   = true
      [32m+[0m [0m[1m[0mstream_label[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mstream_view_type[0m[0m = "NEW_AND_OLD_IMAGES"
      [32m+[0m [0m[1m[0mtags_all[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mwrite_capacity[0m[0m   = (known after apply)

      [32m+[0m [0mattribute {
          [32m+[0m [0m[1m[0mname[0m[0m = "id"
          [32m+[0m [0m[1m[0mtype[0m[0m = "N"
        }
      [32m+[0m [0mattribute {
          [32m+[0m [0m[1m[0mname[0m[0m = "type"
          [32m+[0m [0m[1m[0mtype[0m[0m = "S"
        }

      [32m+[0m [0mglobal_secondary_index {
          [32m+[0m [0m[1m[0mhash_key[0m[0m           = "type"
          [32m+[0m [0m[1m[0mname[0m[0m               = "sort-by-nummber-id"
          [32m+[0m [0m[1m[0mnon_key_attributes[0m[0m = []
          [32m+[0m [0m[1m[0mprojection_type[0m[0m    = "ALL"
          [32m+[0m [0m[1m[0mrange_key[0m[0m          = "id"
        }

      [32m+[0m [0mpoint_in_time_recovery {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mserver_side_encryption {
          [32m+[0m [0m[1m[0menabled[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_arn[0m[0m = (known after apply)
        }

      [32m+[0m [0mttl {
          [32m+[0m [0m[1m[0mattribute_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m        = (known after apply)
        }
    }

[1m  # aws_iam_policy.lambda_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_policy" "lambda_policy" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m      = "/"
      [32m+[0m [0m[1m[0mpolicy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"logs:PutLogEvents",
                          [32m+[0m [0m"logs:CreateLogStream",
                          [32m+[0m [0m"logs:CreateLogGroup",
                          [32m+[0m [0m"kms:*",
                          [32m+[0m [0m"cloudwatch:PutMetricData",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                      [32m+[0m [0mSid      = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mpolicy_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m  = (known after apply)
    }

[1m  # aws_iam_policy_attachment.lambda_attachment[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_policy_attachment" "lambda_attachment" {
      [32m+[0m [0m[1m[0mid[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m       = "test-appsync-04-09-attachment"
      [32m+[0m [0m[1m[0mpolicy_arn[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mroles[0m[0m      = [
          [32m+[0m [0m"test-appsync-04-09-role",
        ]
    }

[1m  # aws_iam_role.ddb_resolver[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "ddb_resolver" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "appsync.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "ddb_resolver"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # aws_iam_role.lambda_datasource_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda_datasource_role" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "appsync.amazonaws.com"
                        }
                      [32m+[0m [0mSid       = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "test-appsync-04-09-appsync-lambda-datasource"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # aws_iam_role.lambda_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda_role" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "lambda.amazonaws.com"
                        }
                      [32m+[0m [0mSid       = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "test-appsync-04-09-role"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # aws_iam_role_policy.ddb_resolver_policy[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy" "ddb_resolver_policy" {
      [32m+[0m [0m[1m[0mid[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m   = "ddb_resolver_policy"
      [32m+[0m [0m[1m[0mpolicy[0m[0m = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"dynamodb:*",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = [
                          [32m+[0m [0m"*",
                        ]
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mrole[0m[0m   = (known after apply)
    }

[0m[1mPlan:[0m 13 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mapi-endpoint[0m[0m = (known after apply)
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
[33m│[0m [0mbut a value was found in file
[33m│[0m [0m"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1LbrbDHTSph4PvSe/terraform.tfvars".
[33m│[0m [0mIf you meant to use this value, add a "variable" block to the
[33m│[0m [0mconfiguration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
[33m│[0m [0mvalue was found in file
[33m│[0m [0m"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1LbrbDHTSph4PvSe/terraform.tfvars".
[33m│[0m [0mIf you meant to use this value, add a "variable" block to the
[33m│[0m [0mconfiguration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m

```

</details>

*Pushed by: @dsl2022, Action: `pull_request`*